app/Models/KriteriaModel.php

SELECT COUNT(*) AS `numrows`
FROM `kriteria`
---
    public function count_filtered($role)
    {
        $this->_get_datatables_query($role);
        return $this->builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `kriteria`
---
    public function count_all($role)
    {
        $this->_get_datatables_query($role);
        return $this->builder->countAllResults();

SELECT *
FROM `kriteria`
WHERE `kriteria`.`deleted_at` IS NULL
---
    public function getKriteria($id = false)
    {
        if ($id == false) {
            return $this->findAll();