app/Models/UsersModel.php

    public function hitungJumlahUser()
    {
        if ($this->where(['users.id_role' => 13])->countAllResults() > 0) {
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`id_role` = 13
AND `users`.`deleted_at` IS NULL