app/Controllers/Backend/Auth/Auth.php

    public function login()
    {
        $rules = [
            'username' => [
                'rules' => 'required|trim',
                'errors' => [
                    'required' => '{field} Tidak Boleh Kosong'
                ]
            ],
            'password' => [
                'rules' => 'required|trim',
                'errors' => [
                    'required' => '{field} Tidak Boleh Kosong'
                ]
            ]
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput();
        }else{
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');
            $dataUser = $this->users->where(['username' => $username,'is_aktif' => '1'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'aap07'
AND `is_aktif` = '1'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

                    $lastsignin = [
                        "last_signin" => Time::now()
                    ];
                    $this->users->update(session()->get('id_user'), $lastsignin);
---
UPDATE `users` SET `last_signin` = '2024-09-02 06:33:00', `updated_at` = '2024-09-02 06:33:00'
WHERE `users`.`id_user` IN ('1')